source/hdk2/hdk2/libhnap12/unittest/tests/WLanRadioSecurity/set-radius2.request

SOAPAction: "http://purenetworks.com/HNAP1/SetWLanRadioSecurity"

﻿<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope 
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <SetWLanRadioSecurity xmlns="http://purenetworks.com/HNAP1/">
      <RadioID>RADIO_2.4GHz</RadioID>
      <Enabled>true</Enabled>
      <Type>WPA-RADIUS</Type>
      <Encryption>TKIP</Encryption>
      <Key>0123456789</Key>
      <KeyRenewal>0</KeyRenewal>
      <RadiusIP1>192.168.1.1</RadiusIP1>
      <RadiusPort1>8000</RadiusPort1>
      <RadiusSecret1>laruhg;;;fhw</RadiusSecret1>
      <RadiusIP2>192.168.1.2</RadiusIP2>
      <RadiusPort2>1</RadiusPort2>
      <RadiusSecret2>radius secret key</RadiusSecret2>
    </SetWLanRadioSecurity>
  </soap:Body>
</soap:Envelope>
